In [4]:
% matplotlib inline
import matplotlib.pyplot as plt
import sqlite3
import os
import pandas as pd
import sqlalchemy as sa

In [8]:
conn = sa.create_engine('sqlite:///../Data/jeopardy.sqlite')

In [9]:
sqlite_file = '../Data/jeopardy.sqlite'

questions = pd.read_sql_table('questions', conn)
questions.head()

,index,game_id,season,round,row,column,category,value,question_text,answer
0,0,5638,33,J,1.0,1.0,GENIUS.,200,Dramatized here is the moment that led to the ...,the theory of relativity
1,1,5638,33,J,1.0,2.0,EDUCATIONAL FILMS,200,"As Ms. Norbury in ""Mean Girls"", she asked, ""Ho...",Tina Fey
2,2,5638,33,J,1.0,3.0,FIRST NAMES IN THE DICTIONARY,200,"Fashionable & high class, like Mr. Bennett",tony
3,3,5638,33,J,1.0,4.0,FOREIGN GEOGRAPHIC TERMS,200,In French: ile,an island
4,4,5638,33,J,1.0,5.0,SMALL ENOUGH TO FIT,200,This name for the little bodysuit with a snap ...,onesie